diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыРеализации</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы   

&НаКлиенте
Процедура СоздатьСписок(Команда)

	НужноСоздатьРеализацию = Ложь;  
	
	ДлительнаяОперация = ВыполнениеНаСервере(НужноСоздатьРеализацию);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры 

&НаКлиенте
Процедура СоздатьРеализацию(Команда)

	НужноСоздатьРеализацию  = Истина;  
	
	ДлительнаяОперация = ВыполнениеНаСервере(НужноСоздатьРеализацию);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);   
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнениеНаСервере(СоздатьРеализацию)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеСпискаНаСервере", Объект.Период, СоздатьРеализацию);

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда
		МассивРеализаций = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьДоговоры(МассивРеализаций);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговоры(МассивРеализаций)

	Объект.ДоговорыРеализации.Очистить();

	Для Каждого Документ Из МассивРеализаций Цикл
		НоваяСтрока = Объект.ДоговорыРеализации.Добавить();
		НоваяСтрока.Договор = Документ.Договор;
		НоваяСтрока.Реализация = Документ.Реализация;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
